In [1]:
import pandas as pd

In [2]:
df2 = pd.read_csv(r"C:\Users\zaiid\OneDrive\Desktop\archive_3\linkedin-jobs-usa.csv")
df2

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,"$75,000.00\r\n -\r\n $95...",New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,"$85,000.00\r\n -\r\n $95...",Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"$130,000.00\r\n -\r\n $1...","Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [3]:
df2.salary

0                                                     NaN
1                                                     NaN
2                                                     NaN
3                                                     NaN
4                                                     NaN
                              ...
2840                                                  NaN
2841    $75,000.00\r\n            -\r\n            $95...
2842                                                  NaN
2843    $85,000.00\r\n            -\r\n            $95...
2844    $130,000.00\r\n            -\r\n            $1...
Name: salary, Length: 2845, dtype: object

In [4]:
salary_values = df2['salary'].str.split('-', expand=True)
lower_salary = salary_values[0].str.replace('[^\d.]', '', regex=True).astype(float)
upper_salary = salary_values[1].str.replace('[^\d.]', '', regex=True).astype(float)
average = (upper_salary + lower_salary)/2
df2['salary'] = average.round()
df2

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,85000.0,New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,90000.0,Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,140000.0,"Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [5]:
df2.salary.value_counts()

salary
55.0        89
75000.0     68
85000.0     58
70.0        57
140000.0    53
110000.0    50
92500.0     38
50.0        38
32.0        37
60.0        37
30.0        36
125000.0    36
89468.0     35
23.0        35
127500.0    34
45.0        34
95000.0     34
105000.0    30
42.0        25
52500.0     22
5900.0      21
82500.0     17
29.0        10
67500.0      6
35.0         5
36.0         5
90000.0      4
107500.0     3
62500.0      3
70000.0      2
40.0         1
84000.0      1
135000.0     1
87500.0      1
91000.0      1
69.0         1
112500.0     1
Name: count, dtype: int64

In [6]:
dict_salary ={55.0 : 55000.0,
              70.0 : 70000.0,
              50.0 : 50000.0,
              32.0 : 32000.0,
              60.0 : 60000.0,
              30.0 : 30000.0,
              23.0 : 45000.0,
              45.0 : 45000.0,
              42.0 : 42000.0,
              5900.0 : 59000.0,
              29.0 : 29000.0,
              35.0 : 35000.0,
              36.0 :36000.0,
              40.0 :40000.0,
              69.0 :69000.0
              }
df2.salary = df2.salary.replace(dict_salary)

In [7]:
df2.salary.mean()

76115.04843918192

In [8]:
df2.title.fillna("Junior Data Analyst", inplace = True)

In [9]:
df2.isnull().any()

title            False
company          False
description      False
onsite_remote    False
salary            True
location         False
criteria         False
posted_date      False
link             False
dtype: bool

In [10]:
df2.title.value_counts()

title
Data Analyst                                           2110
Data Analyst - Recent Graduate                          183
Junior Data Analyst                                     139
Data Analyst - (Remote - US)                             62
Entry-Level Data Analyst                                 37
Associate Data Analyst                                   37
SQL Data Analyst                                         37
Analyst (Global Data and Analytics)                      36
Analyst, Data and Analytics                              36
Analyst - Data Visualization                             35
Data Analyst I (entry level)                             34
Data Analyst (SQL)                                       25
Data Analytics Analyst                                   21
Data Analyst - remote!                                   10
Data Analyst, Money                                       7
Data Analyst - Remote                                     6
Data Analyst I                                            4
Data Analyst (Remote)                                     3
Data Visualization Analyst                                2
Data analyst                                              2
Data Analyst (Global Remote)                              2
REMOTE Data Analyst (SQL, Operations)                     2
Senior Data Analyst                                       1
Data Analyst - Weekly Hybrid Remote/Onsite Schedule       1
Business Data Analyst                                     1
Data Analyst - Energy                                     1
Consultant/Data Analyst                                   1
Group Data Analyst                                        1
Data Analyst (Hybrid)                                     1
Data Analyst (SQL, Teraform, Tableau) III - Remote        1
Data Analyst/ $100M Valuation/ Hybrid                     1
Data Analyst/Collector                                    1
Data Analyst III - Remote                                 1
WFH//Data Analyst                                         1
Marketing Data Analyst                                    1
Entry Level Data Analyst                                  1
Junior Data Analyst-Entry Level                           1
Name: count, dtype: int64

In [11]:
# Dictionary to map similar job titles to a standardized title
#title_mapping = {
 #   "Analyst (Global Data and Analytics)": "Global Data and Analytics Analyst",
  #  "Analyst - Data Visualization": "Data Visualization Analyst",
  #  "Analyst, Data and Analytics": "Data and Analytics Analyst",
   # "Associate Data Analyst": "Associate Data Analyst",
    #"Business Data Analyst": "Business Data Analyst",
 #   "Consultant/Data Analyst": "Consultant/Data Analyst",
 #   "Data Analyst": "Data Analyst",
 #   "Data Analyst (Global Remote)": "Global Remote Data Analyst",
 #   "Data Analyst (Hybrid)": "Hybrid Data Analyst",
 #   "Data Analyst (Remote)": "Remote Data Analyst",
 #   "Data Analyst (SQL)": "SQL Data Analyst",
   # "Data Analyst (SQL, Teraform, Tableau) III - Remote": "Remote SQL Data Analyst",
    #"Data Analyst - (Remote - US)": "Remote US Data Analyst",
  #  "Data Analyst - Energy": "Energy Data Analyst",
   # "Data Analyst - Recent Graduate": "Recent Graduate Data Analyst",
  #  "Data Analyst - Remote": "Remote Data Analyst",
  #  "Data Analyst - Weekly Hybrid Remote/Onsite Schedule": "Weekly Hybrid Remote/Onsite Data Analyst",
  #  "Data Analyst - remote!": "Remote Data Analyst",
  #  "Data Analyst I": "Data Analyst I",
  #  "Data Analyst I (entry level)": "Entry Level Data Analyst",
  #  "Data Analyst III - Remote": "Remote Data Analyst III",
  #  "Data Analyst, Money": "Money Data Analyst",
  #  "Data Analyst/ $100M Valuation/ Hybrid": "Hybrid Data Analyst",
  #  "Data Analyst/Collector": "Collector Data Analyst",
  #  "Data Analytics Analyst": "Data Analytics Analyst",
  #  "Data Visualization Analyst": "Data Visualization Analyst",
  #  "Data analyst": "Data Analyst",
  #  "Entry Level Data Analyst": "Entry Level Data Analyst",
   # "Entry-Level Data Analyst": "Entry Level Data Analyst",
    #"Group Data Analyst": "Group Data Analyst",
    #"Junior Data Analyst": "Junior Data Analyst",
  #  "Junior Data Analyst-Entry Level": "Junior Data Analyst",
  #  "Marketing Data Analyst": "Marketing Data Analyst",
  #  "REMOTE Data Analyst (SQL, Operations)": "Remote SQL Data Analyst",
   # "SQL Data Analyst": "SQL Data Analyst",
   # "Senior Data Analyst": "Senior Data Analyst"
#}

# Update DataFrame with standardized job titles
#df2['title'] = df2['title'].map(title_mapping)
# Dictionary to map similar job titles to a standardized title
title_mapping = {
    "Data Visualization": "Data Visualization",
    "Junior": "Junior Data Analyst",
    "Data and Analytics": "Data and Analytics",
    "Associate Data Analyst": "Associate Data Analyst",
    "Business Data Analyst": "Business Data Analyst",
    "Consultant": "Consultant",
    "Global Remote": "Remote Data Analyst",
    "Hybrid": "Hybrid Data Analyst",
    "Remote": "Remote Data Analyst",
    "SQL": "SQL Data Analyst",
    "Energy": "Energy Data Analyst",
    "Recent Graduate": "Recent Graduate Data Analyst",
    "Weekly Hybrid Remote/Onsite Schedule": "Hybrid Data Analyst",
    "Collector": "Collector Data Analyst",
    "Data Analytics": "Data Analytics Analyst",
    "Marketing": "Marketing Data Analyst",
    "SQL, Operations": "SQL Data Analyst",
    "Senior": "Senior Data Analyst",
    "Entry Level": "Entry Level Data Analyst",
    "Data Analyst": "Data Analyst"
}

# Update DataFrame with standardized job titles
def map_job_title(title):
    for key, value in title_mapping.items():
        if key.lower() in title.lower():
            return value
    return title


updated_title = df2["title"].apply(map_job_title)
df2["title"] = updated_title
df2

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Recent Graduate Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Recent Graduate Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,SQL Data Analyst,Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,85000.0,New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,90000.0,Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,140000.0,"Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [12]:
df2.location.value_counts().head(40)

location
United States                                 632
New York City Metropolitan Area               179
Chicago, IL                                   153
New York, NY                                  100
Austin, TX                                     72
Texas, United States                           67
Timonium, MD                                   61
Dallas, TX                                     55
Boston, MA                                     54
Charlotte, NC                                  41
Miami, FL                                      40
New York, United States                        39
Franklin, TN                                   38
Tempe, AZ                                      38
Illinois, United States                        38
Greensboro--Winston-Salem--High Point Area     37
Greater Scranton Area                          37
Tennessee, United States                       37
Indiana, United States                         37
Denver Metropolitan Area                       36
District of Columbia, United States            36
Conshohocken, PA                               35
Phoenix, AZ                                    35
North Carolina, United States                  35
Greater Sacramento                             35
Richfield, MN                                  35
Morgan Hill, CA                                35
Cincinnati Metropolitan Area                   35
Hartford, CT                                   35
Atlanta Metropolitan Area                      34
Quincy, MA                                     34
Buffalo-Niagara Falls Area                     34
San Francisco, CA                              32
Irvine, CA                                     31
Houston, TX                                    30
Omaha, NE                                      30
San Jose, CA                                   28
Scottsdale, AZ                                 27
San Francisco Bay Area                         25
Manassas, VA                                   25
Name: count, dtype: int64

In [13]:
average_salary_by_title = df2.groupby("title")['salary'].mean()
#df2['salary'] = df2.apply(lambda row: average_salary_by_title[row['title']] if pd.isna(row['salary']) else row['salary'], axis=1)
average_salary_by_title

title
Associate Data Analyst           50000.000000
Business Data Analyst            69000.000000
Collector Data Analyst           62500.000000
Consultant                                NaN
Data Analyst                     81394.224138
Data Analytics Analyst           59000.000000
Data Visualization               85000.000000
Data and Analytics                        NaN
Energy Data Analyst              91000.000000
Entry Level Data Analyst                  NaN
Hybrid Data Analyst             112500.000000
Junior Data Analyst              38408.450704
Marketing Data Analyst           42000.000000
Recent Graduate Data Analyst              NaN
Remote Data Analyst              90000.000000
SQL Data Analyst                 75409.836066
Senior Data Analyst                       NaN
Name: salary, dtype: float64

In [14]:

state_mapping_full = {
    "United States": "United States",
    "New York City Metropolitan Area": "New York",
    "Chicago, IL": "Illinois",
    "New York, NY": "New York",
    "Austin, TX": "Texas",
    "Texas, United States": "Texas",
    "Timonium, MD": "Maryland",
    "Dallas, TX": "Texas",
    "Boston, MA": "Massachusetts",
    "Charlotte, NC": "North Carolina",
    "Miami, FL": "Florida",
    "New York, United States": "New York",
    "Franklin, TN": "Tennessee",
    "Tempe, AZ": "Arizona",
    "Illinois, United States": "Illinois",
    "Greensboro--Winston-Salem--High Point Area": "North Carolina",
    "Greater Scranton Area": "Pennsylvania",
    "Tennessee, United States": "Tennessee",
    "Indiana, United States": "Indiana",
    "Denver Metropolitan Area": "Colorado",
    "District of Columbia, United States": "District of Columbia",
    "Conshohocken, PA": "Pennsylvania",
    "Phoenix, AZ": "Arizona",
    "North Carolina, United States": "North Carolina",
    "Greater Sacramento": "California",
    "Richfield, MN": "Minnesota",
    "Morgan Hill, CA": "California",
    "Cincinnati Metropolitan Area": "Ohio",
    "Hartford, CT": "Connecticut",
    "Atlanta Metropolitan Area": "Georgia",
    "Quincy, MA": "Massachusetts",
    "Buffalo-Niagara Falls Area": "New York",
    "San Francisco, CA": "California",
    "Irvine, CA": "California",
    "Houston, TX": "Texas",
    "Omaha, NE": "Nebraska",
    "San Jose, CA": "California",
    "Scottsdale, AZ": "Arizona",
    "San Francisco Bay Area": "California",
    "Manassas, VA": "Virginia"
}


df2['location'] = df2['location'].map(state_mapping_full)

In [15]:
df2.location.value_counts()

location
United States           632
New York                352
Texas                   224
Illinois                191
California              186
North Carolina          113
Arizona                 100
Massachusetts            88
Tennessee                75
Pennsylvania             72
Maryland                 61
Florida                  40
Indiana                  37
Colorado                 36
District of Columbia     36
Ohio                     35
Minnesota                35
Connecticut              35
Georgia                  34
Nebraska                 30
Virginia                 25
Name: count, dtype: int64

In [16]:
state_counts = df2["location"].value_counts()
total_count = state_counts.sum() - state_counts["United States"]
ratios = state_counts / total_count
replacements = (df2["location"].value_counts()["United States"] * ratios).round().astype(int)
print(replacements)
for i, location in enumerate(df2["location"]):
    if location == "United States":
        for key, value in replacements.items():
            if value > 0 and key != "United States":
                df2.at[i, "location"] = key
                replacements[key] -= 1
                break

location
United States           221
New York                123
Texas                    78
Illinois                 67
California               65
North Carolina           40
Arizona                  35
Massachusetts            31
Tennessee                26
Pennsylvania             25
Maryland                 21
Florida                  14
Indiana                  13
Colorado                 13
District of Columbia     13
Ohio                     12
Minnesota                12
Connecticut              12
Georgia                  12
Nebraska                 11
Virginia                  9
Name: count, dtype: int32

In [17]:
df2.location.value_counts()

location
New York                475
Texas                   302
Illinois                258
California              251
North Carolina          153
Arizona                 135
Massachusetts           119
Tennessee               101
Pennsylvania             97
Maryland                 82
Florida                  54
Indiana                  50
Colorado                 49
District of Columbia     49
Minnesota                47
Connecticut              47
Ohio                     47
Georgia                  46
Nebraska                 41
Virginia                 34
Name: count, dtype: int64

In [18]:
df2

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Recent Graduate Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,New York,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Recent Graduate Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,California,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Texas,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Illinois,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,Illinois,"[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,Texas,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,SQL Data Analyst,Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,85000.0,New York,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,NaN,"[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,90000.0,NaN,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,140000.0,NaN,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [20]:
df2.groupby("location")["salary"].mean()

location
Arizona                  81431.818182
California               70408.450704
Colorado                 40411.111111
Connecticut              89375.000000
District of Columbia    117546.511628
Florida                  86250.000000
Georgia                  81888.888889
Illinois                 86000.000000
Indiana                 103750.000000
Maryland                 86363.636364
Massachusetts            82700.000000
Minnesota                50583.333333
Nebraska                 95000.000000
New York                 72483.673469
North Carolina           69901.639344
Ohio                     71000.000000
Pennsylvania             86603.829787
Tennessee               102305.555556
Texas                    83276.595745
Virginia                140000.000000
Name: salary, dtype: float64

In [23]:
df2.location.value_counts()

location
New York                475
Texas                   302
Illinois                258
California              251
North Carolina          153
Arizona                 135
Massachusetts           119
Tennessee               101
Pennsylvania             97
Maryland                 82
Florida                  54
Indiana                  50
Colorado                 49
District of Columbia     49
Minnesota                47
Connecticut              47
Ohio                     47
Georgia                  46
Nebraska                 41
Virginia                 34
Name: count, dtype: int64

In [29]:
data = {
    "location": ["Arizona", "California", "Colorado", "Connecticut", "District of Columbia",
                 "Florida", "Georgia", "Illinois", "Indiana", "Maryland", "Massachusetts",
                 "Minnesota", "Nebraska", "New York", "North Carolina", "Ohio", 
                 "Pennsylvania", "Tennessee", "Texas"],
    "salary": [81431.818182, 70408.450704, 40411.111111, 89375.000000, 117546.511628,
               86250.000000, 81888.888889, 86000.000000, 103750.000000, 86363.636364,
               82700.000000, 50583.333333, 95000.000000, 72483.673469, 69901.639344,
               71000.000000, 86603.829787, 102305.555556, 83276.595745],
    "count": [135, 251, 49, 47, 49, 54, 46, 258, 50, 82, 119, 47, 41, 475, 153, 47, 97, 101, 302]
}

result_df = pd.DataFrame(data)
result_df

                location         salary  count
0                Arizona   81431.818182    135
1             California   70408.450704    251
2               Colorado   40411.111111     49
3            Connecticut   89375.000000     47
4   District of Columbia  117546.511628     49
5                Florida   86250.000000     54
6                Georgia   81888.888889     46
7               Illinois   86000.000000    258
8                Indiana  103750.000000     50
9               Maryland   86363.636364     82
10         Massachusetts   82700.000000    119
11             Minnesota   50583.333333     47
12              Nebraska   95000.000000     41
13              New York   72483.673469    475
14        North Carolina   69901.639344    153
15                  Ohio   71000.000000     47
16          Pennsylvania   86603.829787     97
17             Tennessee  102305.555556    101
18                 Texas   83276.595745    302